app/controllers/users_workouts_controller.rb

SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "workouts" INNER JOIN "users_workouts" ON "workouts"."id" = "users_workouts"."workout_id" WHERE "users_workouts"."user_id" = $1 AND "workouts"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def buy
      workout = Workout.find params[:id]
      unless current_user.workouts.where(id: params[:id]).any?

SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "workouts".* FROM "workouts" INNER JOIN "users_workouts" ON "workouts"."id" = "users_workouts"."workout_id" WHERE "users_workouts"."user_id" = $1 AND "workouts"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "workouts" INNER JOIN "users_workouts" ON "workouts"."id" = "users_workouts"."workout_id" WHERE "users_workouts"."user_id" = $1 AND "workouts"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def cancel
      workout = Workout.find params[:id]
      if current_user.workouts.where(id: params[:id]).any?