app/controllers/workouts_controller.rb

SELECT "workouts".* FROM "workouts"
---
        def index
          @workouts = Workout.all

SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT 1 AS one FROM "workouts" INNER JOIN "users_workouts" ON "workouts"."id" = "users_workouts"."workout_id" WHERE "users_workouts"."user_id" = $1 AND "workouts"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        def show
          @user_buy_current_workout = user_signed_in? && current_user.workouts.where(id: params[:id]).any?
          @workout = Workout.find(params[:id])

SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        def edit
          @workout = Workout.find(params[:id])

INSERT INTO "workouts" ("title", "descriprtion", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "ФЫВФЫ"], ["descriprtion", "ФЫВ"], ["created_at", "2024-01-09 07:22:23.286051"], ["updated_at", "2024-01-09 07:22:23.286051"]]
---
        def create
          @workout = Workout.new(workout_params)

          respond_to do |format|
            if @workout.save

SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "workouts" SET "title" = $1, "updated_at" = $2 WHERE "workouts"."id" = $3  [["title", "wadss"], ["updated_at", "2024-01-09 07:27:15.087009"], ["id", 1]]
---
        def update
          @workout = Workout.find(params[:id])
          respond_to do |format|
            if @workout.update(workout_params)

SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "workouts" WHERE "workouts"."id" = $1  [["id", 1]]
---
        def destroy
          @workout = Workout.find(params[:id])
          begin
            authorize @workout
          rescue Pundit::NotAuthorizedError
            redirect_to root_path
            return
          end

            @workout.destroy